Revit 2026 API

# RebarContainerItemSetFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IListCurve, RebarTerminationOrientation, RebarTerminationOrientation, Boolean, Boolean) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFromCurves(
	RebarStyle style,
	RebarBarType barType,
	RebarHookType startHook,
	RebarHookType endHook,
	XYZ norm,
	IList<Curve> curves,
	RebarTerminationOrientation startHookOrient,
	RebarTerminationOrientation endHookOrient,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```
```vb
Public Sub SetFromCurves (
	style As RebarStyle,
	barType As RebarBarType,
	startHook As RebarHookType,
	endHook As RebarHookType,
	norm As XYZ,
	curves As IList(Of Curve),
	startHookOrient As RebarTerminationOrientation,
	endHookOrient As RebarTerminationOrientation,
	useExistingShapeIfPossible As Boolean,
	createNewShape As Boolean
)
```
```cpp
public:
void SetFromCurves(
	RebarStyle style,
	RebarBarType^ barType,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	XYZ^ norm,
	IList<Curve^>^ curves,
	RebarTerminationOrientation startHookOrient,
	RebarTerminationOrientation endHookOrient,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```
```fsharp
member SetFromCurves :
        style : RebarStyle *
        barType : RebarBarType *
        startHook : RebarHookType *
        endHook : RebarHookType *
        norm : XYZ *
        curves : IList<Curve> *
        startHookOrient : RebarTerminationOrientation *
        endHookOrient : RebarTerminationOrientation *
        useExistingShapeIfPossible : bool *
        createNewShape : bool -> unit
```

#### Parameters

style RebarStyle

barType RebarBarType

startHook RebarHookType

endHook RebarHookType

norm XYZ

curves IListCurve

startHookOrient RebarTerminationOrientation

endHookOrient RebarTerminationOrientation

useExistingShapeIfPossible Boolean

createNewShape Boolean

#### Reference

RebarContainerItem Class

SetFromCurves Overload

Autodesk.Revit.DB.Structure Namespace